
Feature: Регистрация на нов потребител
	Background: Поптребителя отваря формата за регистарция
		Given Потребителя отваря екрана за вход в системата

  Scenario: Регистрация с валидни входни данни
    When Въведежда потребителско име
    And въвежда парола
    And натиска бутона за регистрация
    Then Вижда съобщение "ok"
    
  Scenario: Регистрация без парола
    When Въведежда потребителско име
    And натиска бутона за регистрация
    Then Вижда съобщение "missing pass"
    
  Scenario: Регистрация без име
    When въвежда парола
    And натиска бутона за регистрация
    Then Вижда съобщение "missing username"


